Repository: GroophyLifefor/picobat
Catalog: po/*/pBat.po
Languages: ca, fr, hi

source: No error: OK.
ca: Cap error: D'acord.
fr: Aucune erreur: OK.
hi: कोई गलती नहीं

source: Error : Unable to access file "%s".
ca: Incapaç d'accedir l'arxiu "%s".
fr: Erreur : Impossible d'accéder au fichier "%s".
hi: ग़लत : "% s" फ़ाइल खोलने में असमर्थ

source: Error : Unable to find folder "%s".
ca: Error: Incapaç de trobar la carpeta "%s".
fr: Erreur : Impossible de trouver le dossier "%s".
hi: ग़लत : "% s" फ़ाइल खोजने में असमर्थ

source: Error : "%s" is not recognized as an internal or external command, an operable program or a batch file.
ca: Error: "%s" no es reconeix com un comandament intern o extern, programa o arxiu per lots executable.
fr: Erreur : "%s" n'est pas reconnu en tant que commande interne ou externe, programme exécutable ou fichier batch.
hi: ग़लत : "%s" कोई आंतरिक या बाहरी कमांड, अथवा कोई प्रोग्राम या बैच फ़ाइल के रूप में पहचाना नहीं जाता है।

source: Error : "%s" was unexpected.
ca: Error: "%s" ha sigut inesperat.
fr: Erreur : "%s" était inatendu.
hi: ग़लत : "% s" की उम्मीद नहीं थी

source: Error : Invalid command line for %s.
ca: Error: Línia d'ordres invàlida per %s.
fr: Erreur : Ligne de commande invalide "%s".
hi: ग़लत : "%s" के लिए गलत कमांड लाइन।

source: Error : Unable to find label "%s".
ca: Error: Incapaç de trobar l'etiqueta "%s".
fr: Erreur : Impossible de trouver l'étiquette "%s".
hi: ग़लत : लेबल "%s" ढूंढने में असमर्थ।

source: Error : "%s" expected more arguments.
ca: Error: "%s" esperats més arguments.
fr: Erreur : "%s" attendait plus d'arguments.
hi: ग़लत : "%s"अधिक विकल्प की उम्मीद है।

source: Error : Incompatible arguments %s.
ca: Error: Arguments incompatibles %s.
fr: Erreur : Arguments incompatibles %s.
hi: ग़लत : "%s" अनुचित विकल्प.

source: Error : Unable to rename "%s".
ca: Error: Incapaç de renombrar "%s".
fr: Erreur : Impossible de renommer "%s".
hi: ग़लत: "%s" का नाम बदलने में असमर्थ।

source: Error : Overflown maximum value.
ca: Error: Desbordament del valor màxim.
fr: Erreur : Dépassement de valeur maximale.
hi: ग़लत: आपने अधिकतम क्षमता पार कर ली है

source: Error : Divide by 0.
ca: Error: Divisió entre 0.
fr: Erreur : Division par 0.

source: Error : Unable to create folder "%s".
ca: Error: Incapaç de crear la carpeta "%s".
fr: Erreur : Impossible de créer le dossier "%s".
hi: ग़लत : Unable to create folder "%s".

source: Error : Unable to delete folder "%s".
ca: Error: Incapaç d'eliminar la carpeta "%s".
fr: Erreur : Impossible de suprimmer le dossier "%s".
hi: ग़लत: फ़ोल्डर "%s" को हटाने में असमर्थ ।

source: Error : Stream module : "%s".
ca: Error: Mòdul de transmissió: "%s".
fr: Erreur : Module de flux : "%s".
hi: ग़लत: स्ट्रीम मॉड्यूल: "%s"

source: Error : "%c" is an invalid character for special variables. Special variables require their name to be strict ascii characters, excluding controls characters and space (0x00 - 0x30).
ca: Error: "%c" es un caràcter invàlid per les variables especials. Les variables especials requereixen que el seu nom sigui estrictament caràcters ascii, excloent caràcters de control i espai (0x00 - 0x30).
fr: Erreur : "%c" est un caractère invalide pour les variable spéciales. Le nom variables spécial doit être un caractère ASCII strict, à l'exception des caractères de contrôle et de l'espace (0x00-0x30).
hi: ग़लत: "%c" विशेष प्रकार के चर के लिए उपयुक्त नाम नहीं है. विशेष चर के लिए उनके नामों को सख्त ASCII वर्ण होने की आवश्यकता होती है, नियंत्रण वर्णों को छोड़कर, और स्थान (0x00 - 0x30).

source: Error : "%s" is not a valid block (should at least be enclosed within parenthesis).
ca: Error: "%s" no és un bloc vàlid (almenys hauria d'estar tancat sense parèntesis).
fr: Errur : "%s" n'est pas un bloc valable (devrait être entouré de parenthèses).
hi: ग़लत: "%s" एक मान्य ब्लॉक नहीं है (कम से कम कोष्ठक के भीतर संलग्न किया जाना चाहिए)

source: Error : "%s" is not a valid token specifier.
ca: Error: "%s" no es un especificador de token vàlid.
fr: Erreur : "%s" n'est pas une description de token valide.
hi: ग़लत: "%s" मान्य टोकन विनिर्देशक नहीं है।

source: Error : Attempted to specify more than TOKEN_NB_MAX (%d) different tokens.
ca: Error: S'ha intentat especificar més de TOKEN_NB_MAX (%d) tokens diferents.
fr: Erreur : La commande a tenté de spécifier plus de TOKEN_NB_MAX(%d) tokens différent.
hi: ग़लत: TOKEN_NB_MAX (% d) अलग टोकन से अधिक निर्दिष्ट करने का प्रयास किया गया।

source: Error : "%s" violates the ``Usebackq'' syntax.
ca: Error: "%s" viola la sintaxi ``Usebackq''.
fr: Erreur : "%s" viole la syntaxe ``Usebackq''.
hi: ग़लत: "% s" "Usebackq" के सही उपयोग का उल्लंघन करता है।

source: Error : Unable to allocate memory (in %s).
ca: Error: Incapaç d'assignar la memòria (a %s).
fr: Erreur : Impossible d'allouer de la mémoire (dans %s).
hi: ग़लत: picobat "% s" के लिए रैम में पर्याप्त जगह नहीं एकत्र कर सकता

source: Error : Can't create pipe (in %s).
ca: Error: No es pot crear una canalització (a %s)
fr: Erreur : Impossible de créer un pipe (dans %s).
hi: ग़लत : "%s" में पाइप नहीं बना सकता है।

source: Error : Invalid token specifier. "%s" breaks input specifying rules.
ca: Error: Especificador de token invàlid. "%s" trenca les regles d'especificació.
fr: Erreur : "%s" brise les règles de spécification de tokens.
hi: ग़लत: अमान्य टोकन विनिर्देशक। "% s" इनपुट निर्दिष्ट नियमों को तोड़ देता है।

source: Error : FOR loop is trying to reassign already used %%%%%c variable.
ca: Error: El bucle FOR està intentant reassignar la variable ja utilitzada %%%%%c.
fr: Erreur : La boucle FOR a essayé de réassigner la variable %%%%%c qui est déjà utilisée.
hi: ग़लत: FOR लूप पहले से ही %%%%%c का उपयोग करने का प्रयास कर रहा है।

source: Error : "%s" is not a valid mathematical expression.
ca: Error: "%s" no és una expressió matemàtica vàlida.
fr: Erreur : "%s" n'est pas une expression mathématique valide.
hi: ग़लत: "% s" मान्य गणितीय अभिव्यक्ति नहीं है।

source: Error : "%s" is not a valid top-level block.
ca: Error: "%s" no és un bloc vàlid d'alt nivell.
fr: Erreur : "%s" n'est pas un block de niveau supérieur valide.
hi: ग़लत: "% s" शीर्ष-स्तरीय ब्लॉक मान्य नहीं है।

source: Error : Unable to duplicate file descriptor (%d).
ca: Error: Incapaç de duplicar el descriptor de fitxers (%d).
fr: Erreur : Impossible de duppliquer le descripteur de fichier (%d).
hi: ग़लत: फ़ाइल डिस्क्रिप्टर (%d) को डुप्लिकेट करने में असमर्थ।

source: Error : Unable to create pipe at function (%s).
ca: Error: Incapaç de crear una canalització a la funció (%s).
fr: Erreur : Impossible de créer un pipe (dans %s).
hi: ग़लत: फ़ंक्शन (%s) पर पाइप बनाने में असमर्थ।

source: Error : Unable to set environment string (%s).
ca: Error: Incapaç d'establir la cadena d'entorn (%s).
fr: Erreur : Impossible de modifier la variable d'environement (dans %s).
hi: ग़लत: पर्यावरण स्ट्रिंग (%s) सेट करने में असमर्थ।

source: Error : "%s" is an invalid stream redirection.
ca: Error: "%s" és una redirecció de transmissió invàlida.
fr: Erreur : "%s" n'est pas une redirection valide.
hi: ग़लत: "%s" एक अमान्य स्ट्रीम दिशा भेज रहा है।

source: Error : Redirection for "%s" was already specified.
ca: Error: La redirecció per "%s" ja ha sigut especificada.
fr: Erreur : Une redirection pour "%s" était déjà spécifiée.
hi: ग़लत: "% s" के लिए पुनर्निर्देशन पहले ही बता दिया था

source: Error : Encountered malformed blocks ("%s").
ca: Error: S'han trobat blocs mal formats ("%s").
fr: Erreur : Mauvais bloc ("%s").
hi: ग़लत: विकृत ब्लॉक्स से सामना हुआ । ("%s")

source: Error : Blocks left unclosed at end-of-file.
ca: Error: Queden blocks no tancats al final del fitxer.
fr: Erreur : Bloc non fermé à la fin du fichier.
hi: ग़लत: फ़ाइल के अंत में ब्लॉक बंद नहीं हैं।

source: Error : Unable to add command "%s".
ca: Error: Incapaç d'afegir el comandament "%s".
fr: Erreur : Impossible de renommer "%s".
hi: ग़लत: "%s" कमांड जोड़ने में असमर्थ।

source: Error : Unable to remap commands (in function %s).
ca: Error: FALTA MILLORAR (%s).
fr: Erreur : Impossible de remaper les commandes (dans %s).
hi: ग़लत: आदेश remap करने में असमर्थ (%s) ।

source: Error : Trying to redefine already used "%s" command.
ca: Error: Intentant redefinir el comandament ja utilitzat "%s".
fr: Erreur : Tentative de réassignement de la commande déjà utilisée "%s".
hi: ग़लत: "%s" आदेश का पहले से ही उपयोग फिर से परिभाषित करने का प्रयास कर रहा है ।

source: Error : Unable to redefine "%s" command.
ca: Error: Incapaç de redefinir el comandament "%s".
fr: Erreur : Impossible de redéfinir la commande "%s".
hi: ग़लत: "%s" कमांड को फिर से परिभाषित करने में असमर्थ।

source: Error : The "%s" comparison forbids use of strings.
ca: Error: La comparació "%s" prohibeix l'ús de cadenes.
fr: Erreur : Le comparant "%s" interdit l'usage de chaines.
hi: ग़लत: "%s" तुलना टेक्स्ट स्ट्रिंग्स के उपयोग को रोकता है।

source: Error : Unable to fork the current process (in function %s).
ca: Error: Incapaç de bifurcar el procés actual (en la funció %s).
fr: Erreur : Impossible de forker le processus courant (dans %s).
hi: ग़लत: वर्तमान प्रक्रिया (फ़ंक्शन "%s" में) कांटा करने में असमर्थ ।

source: Error : Pathspec "%s" does not match any file.
ca: Error: Pathspec "%s" no correspon a cap fitxer.
fr: Erreur : L'expression "%s" ne correspond à aucun fichier.
hi: ग़लत: Pathspec "%s" किसी भी फ़ाइल से मेल नहीं खाती ।

source: Error : %s does not recieved any valid file to process.
ca: Error: %s no ha rebut cap fitxer valid al procés.
fr: Erreur : %s n'a reçu aucun fichier valide à traiter.
hi: ग़लत: "%s" को संसाधित करने के लिए कोई मांय फ़ाइल प्राप्त नहीं हुई ।

source: Error : "%s" is not a valid number.
ca: Error: "%s" no és un número vàlid.
fr: Erreur : "%s" n'est pas un nombre valide.
hi: ग़लत: "%s" मान्य संख्या नहीं है।

source: Error : Too many arguments for %s command
ca: Error: Massa arguments pel comandament %s
fr: Erreur : Trop d'arguments pour la commande %s.
hi: ग़लत: कमांड "%s" में बहुत ज्यादा आर्गुमेंट हैं

source: Error : "%s" is not a valid expression for IF command.
ca: Error: "%s" no és una expressió vàlida pel comandament IF.
fr: Erreur : "%s" n'est pas une expression valide pour la commande IF.
hi: ग़लत: "%s" - IF कमांड के लिए कोई मांय व्यंजक नहीं है ।

source: Error : Unable to copy file "%s".
ca: Error: Incapaç de copiar el fitxer "%s".
fr: Erreur : Impossible de copier le fichier"%s".
hi: ग़लत: फ़ाइल "% s" की प्रतिलिपि बनाने में असमर्थ।

source: Error : Unable to move file "%s".
ca: Error: Incapaç de moure el fitxer "%s".
fr: Erreur : Impossible de déplacer le fichier "%s".
hi: ग़लत: फ़ाइल "% s" को स्थानांतरित करने में असमर्थ।

source: Error : Unable to create directory "%s".
ca: Error: Incapaç de crear el directori "%s".
fr: Erreur : Impossible de créer le dossier "%s".
hi: ग़लत: फ़ोल्डर "%s" बनाने में असमर्थ।

source: Error : Unable to delete file "%s".
ca: Error: Incapaç d'eliminar el fitxer "%s".
fr: Erreur : Impossible de suprimmer le fichier "%s".
hi: ग़लत: फ़ाइल "%s" को हटाने में असमर्थ।

source: Error : Unable to delete directory "%s".
ca: Error: Incapaç d'eliminar el directori "%s".
fr: Erreur : Impossible de suprimmer le dossier "%s".
hi: ग़लत: फ़ोल्डर "%s" को हटाने में असमर्थ।

source: Error : "%s" is not a valid codepage on your system.
ca: Error: "%s" no és una pàgina de codis vàlida al teu sistema.
fr: Erreur : "%s" n'est pas une page valide sur votre système.
hi: ग़लत: "%s" आपके सिस्टम पर मान्य कोडपृष्ठ नहीं है।

source: Error : "%s" is a relative path, RENAME (or REN) do not handles relative path. If you want to move the file and rename it at the same time, you should use MOVE command.
ca: Error: "%s" és un camí relatiu, RENAME (o REN) no admet camins relatius. Si vols moure el fitxer i renombrar-lo al mateix temps, hauries d'utilitzar el comandament MOVE.
fr: Erreur : "%s" est un chemin relatif. Les commandes RENAME et REN ne supportent pas les chemins relatifs. Pour déplacer et renommer un fichier de façon simultanée, utilisez la commande MOVE.
hi: ग़लत: "%s" एक सापेक्ष पथ है, RENAME (या REN) सापेक्ष पथ को नहीं समझता है। यदि आप फ़ाइल को स्थानांतरित करना चाहते हैं और एक ही समय में इसका नाम बदलना चाहते हैं, तो आपको MOVE कमांड का उपयोग करना चाहिए।

source: Error : Invalid label encountered within a block (at line %d).
ca: Error: Etiqueta invàlida trobada sense un bloc (a la línia %d).
fr: Erreur : étiquette rencontrée à l'intérieur d'un block (ligne %d).
hi: ग़लत: ब्लॉक के भीतर अमान्य लेबल का सामना करना पड़ा (लाइन "%d" पर)।

source: Error : Unable to lock mutex (%s).
ca: Error: Incapaç de bloquejar l'exclusió mútua (%s).
fr: Erreur : Impossible de saisir le mutex (%s).
hi: ग़लत: mutex (%s) को लॉक करने में असमर्थ।

source: Error : Unable to release mutex (%s).
ca: Error: Incapaç de llançar l'exclusió mútua (%s).
fr: Erreur : Impossible de libérer le mutex (%s).
hi: ग़लत: mutex (%s) को रिलीज़ करने में असमर्थ।

source: Error : Unable to catenate file "%s".
ca: Error: Incapaç de concatenar el fitxer "%s".
fr: Erreur : Impossible de concaténer "%s".
hi: ग़लत: फाइल "%s" को बदलने में असमर्थ

source: Error : Unable to load module "%s".
ca: Error: Incapaç de carregar el mòdul "%s".
fr: Erreur : Impossible de charger le module "%s".
hi: ग़लत: "%s" का नाम बदलने में असमर्थ।

source: Error : Incompatible module "%s".
ca: Error: Mòdul incompatible "%s".
fr: Erreur : Module "%s" incompatible.
hi: ग़लत : "%s" अनुचित विकल्प.

source: Error : Module "%s" is already loaded.
ca: Error: El mòdul "%s" ja està carregat.
fr: Erreur : Le module "%s" est déjà chargé.
hi: ग़लत: "% s" के लिए पुनर्निर्देशन पहले ही बता दिया था

source: Echo command enabled
ca: Comandament echo habilitat
fr: Commande echo activée
hi: इको कमांड चालू

source: Echo command disabled
ca: Comandament echo inhabilitat
fr: Commande echo désactivée
hi: इको कमांड बंद कर दिया

source: Press any key to continue...
ca: Prem qualsevol tecla per continuar...
fr: Appuyez sur une touche pour continuer...
hi: आगे बढ़ने के लिए कोई कुंजी दबाएं...

source: No files found
ca: No s'han trobat arxius
fr: Aucun fichier trouvé
hi: कोई फाइल नहीं मिली

source: Last change Size Attr. Name
ca: Últim canvi Mida Atr. Nom
fr: Dernière modif. Taille Attr. Nom
hi: अंतिम change Size Attr. Name

source: Files
ca: Fitxers
fr: Fichiers
hi: फ़ाइलें: (i)

source: Folders
ca: Carpetes
fr: Dossiers
hi: फ़ोल्डर

source: Are you sure you want to delete file "%s" ?
ca: Estàs segur que vols eliminar el fitxer "%s"?
fr: Êtes-vous sûr de vouloir supprimer le fichier "%s" ?
hi: क्या आप सचमुच "%s" को मिटाना चाहते हैं?

source: Are you sure you want to remove "%s" directory ?
ca: Estàs segur que vols eliminar el directori "%s"?
fr: Êtes-vous sûr de vouloir supprimer le dossier "%s" ?
hi: क्या आप वाकई "%s" फ़ोल्डर को हटाना चाहते हैं?

source: File "%s" already exists, replace it by "%s" ?
ca: El fitxer "%s" ja existeix, substituir-lo per "%s"?
fr: Le fichier "%s" existe déjà, voulez vous le remplacer par "%s" ?
hi: फ़ाइल "%s" पहले से मौजूद है, इसे "%s" से प्रतिस्थापित करें?

source: Do you really want to exit command script ?
ca: Realment vols sortir de la seqüència de comandaments?
fr: Voulez vous vraiment quitter le script de commande ?
hi: क्या आप वास्तव में ऐप से बाहर निकलना चाहते हैं?

source: (Yes/no)
ca: (Sí/no)
fr: (Oui/non)
hi: हाँ/ नहीं

source: (yes/No)
ca: (sí/No)
fr: (oui/Non)
hi: हाँ/ नहीं

source: (yes/no)
ca: (sí/no)
fr: (oui/non)
hi: हाँ/ नहीं

source: (Yes/no/all)
ca: (Sí/no/tot)
fr: (Oui/non/tous)
hi: (हां / नहीं / सब)

source: (yes/No/all)
ca: (sí/No/tot)
fr: (oui/Non/tous)
hi: (हाँ / नहीं / सब)

source: (yes/no/All)
ca: (sí/no/Tot)
fr: (oui/non/Tous)
hi: (हाँ / नहीं / सब)

source: (yes/no/all)
ca: (sí/no/tot)
fr: (oui/non/tous)
hi: (हाँ / नहीं / सब)

source: YES
ca: SÍ
fr: OUI
hi: हां

source: Y
ca: S
fr: O

source: NO
fr: NON
hi: नही

source: ALL
ca: TOT
fr: TOUS
hi: इनमें से सभी

source: A
ca: T
fr: T

source: Please enter a correct choice (or type enter to choose default) !
ca: Sisplau introdueixi una elecció correcte (o prem return per triar per defecte)!
fr: Merci d'entrer un choix correct (ou appuyez sur entrée pour le choix par défaut) !
hi: कृपया सही विकल्प दर्ज करें (या डिफ़ॉल्ट चुनने के लिए एंटर टाइप करें)!

source: %d files matching, print anyway ?
ca: %d fitxers corresponents, imprimir de totes maneres?
fr: %d fichiers correspondant, afficher quand même ?

source: Waiting for %f seconds, press a key to continue ...
ca: Esperant %f segons, prem una tecla per continuar...
fr: En attente pour %f secondes, appuyez sur une touche pour continuer ...

source: Waiting for %f seconds, press CTRL-C to continue ...
ca: Esperant %f segons, prem Control-C per continuar...
fr: En attente pour %f secondes, appuyez sur CTRL-C pour continuer ..

source: Press a key to continue ...
ca: Prem una tecla per continuar...
fr: Appuyez sur une touche pour continuer ...

source: Press CTRL-C to continue ...
ca: Prem Control-C per continuar...
fr: Appuyez sur CTRL-C pour continuer ...

source: Loaded modules :
ca: Mòduls carregats:
fr: Modules chargés :

source: Create an alias on a command. Usage: ALIAS [/f] alias=command
fr: Crée un alias sur une commande. Usage: ALIAS [/f] alias=command

source: Change current working directory. Usage: CD [[/d] path] CHDIR [[/d] path]
ca: Canvia el directori actual Ús: CD [[/d] ruta] CHDIR [[/d] ruta]
fr: Change le chemin courant. Usage: CD [[/d] chemin] CHDIR [[/d] chemin]
hi: वर्तमान कार्यशील निर्देशिका बदलें। उपयोग: CD [[/D] पथ] CHDIR [[/D] पथ]

source: Clear console screen Usage: CLS
ca: Neteja la pantalla de la consola: Ús: CLS
fr: Efface le contenu de la console Usage: CLS
hi: कंसोल स्क्रीन साफ़ करे: प्रयोग: CLS

source: Change console color to the given code. Usage: COLOR [code]
ca: Canvia el color de la consola al color especificat. Ús: COLOR [codi]
fr: Change la couleur de toute la console. Usage: COLOR [code]
hi: दिए गए कोड में कंसोल रंग बदलें। उपयोग: Color [कोड]

source: Copy file(s) to another location. Usage: COPY [/R] [/-Y | /Y] [/A[:]attributes] source [+] ... destination
ca: Copia fitxers a una altra destinació. Ús: COPY [/R] [/-Y | /Y] [A:[:]atributs] origen [ + ] ... destinació
fr: Copie des fichiers vers un autre répertoire. Usage: COPY [/R] [/-Y | /Y] [/A[:]attributs] source [+] ... destination
hi: फ़ाइल को किसी अन्य स्थान पर कॉपी करें। उपयोग: Copy [/R] [/-Y | /Y] [/A[:]गुण] स्रोत[+] ... गंतव्य

source: Call a script or a label from the current context. Usage: CALL [/e] [file] [:label] [parameters ...]
ca: Crida a una seqüència de comandaments o una etiqueta des del context actual. Ús: CALL [/e] [fitxer] [:etiqueta] [paràmetres ...]
fr: Appelle un script ou un étiquette depuis le contexte courant. Usage: CALL [/e] [fichier] [:étiquette] [paramètres ...]
hi: वर्तमान प्रसंग से कोई स्क्रिप्ट या लेबल कॉल करें । उपयोग: Call [/e] [फ़ाइल] [:लेबल] [पैरामीटर्स...]

source: Delete file(s). Usage: DEL [/P] [/F] [/S] [/Q] [/A[:]attributes] name ERASE [/P] [/F] [/S] [/Q] [/A[:]attributes] name
ca: Elimina fitxers. Ús: DEL [/P] [/F] [/S] [/Q] [/A[:]atributs] nom ERASE [/P] [/F] [/S] [/Q] [/A[:]atributs] nom
fr: Supprime des fichiers. Usage: DEL [/P] [/F] [/S] [/Q] [/A[:]attributs] nom ERASE [/P] [/F] [/S] [/Q] [/A[:]attributes] nom
hi: फ़ाइल (फ़ाइलें) हटाएं । उपयोग: DEL [/P] [f] [/] [/Q] [/A[:] विशेषताएँ] नाम मिटा [/P] [f] [/[] [/Q] [/A[:] विशेषताएँ] नाम

source: List files in a directory and in subdirectories. Usage: DIR [/A[:]attributes] [/S] [/B] [path]
ca: Llista fitxers en un directori i en subdirectoris. Ús: DIR [/A[:]atributs] [/S] [/B] [ruta]
fr: Liste les fichiers d'un répertoire et de ses sous-répertoires. Usage: DIR [/A[:]attributs] [/S] [/B] [chemin]
hi: एक निर्देशिका में और उपनिदेशकों में फ़ाइलें सूचीबद्ध करें । उपयोग: DIR [/A[:] विशेषताएँ] [/s] [/B] [पथ]

source: Print a message, or enable/disable command echoing. Usage: ECHO [OFF|ON] ECHO text ECHO.text
ca: Imprimeix un missatge, o habilita/inhabilita l'eco dels comandaments. Ús: ECHO [OFF | ON] ECHO text ECHO.text
fr: Affiche un message, ou active/désactive l'affichage des commandes. Usage: ECHO [OFF|ON] ECHO texte ECHO.texte
hi: एक संदेश प्रदर्शन करें, या echo कमांड शुरू या बंद करें/ उपयोग: Echo [बंद । चालू] Echo संदेश Echo. संदेश

source: Perform commands against items (files, strings, command output). Usage: FOR %%A IN (string) DO ( :: some commands ) FOR /F [options] %%A IN (object) DO ( :: some commands ) FOR /L %%A IN (start,increment,end) DO ( :: some commands )
ca: Executa comandaments contra items (fitxers, cadenes, sortida dels comandaments). Ús: FOR %%A IN (cadena) DO ( :: alguns comandaments ) FOR /F [opcions] %%A IN (objecte) :: alguns comandaments ) FOR /L %%A IN (inici,increment,fi) :: alguns comandaments )
fr: Effectue une boucle de commandes sur des éléments. Usage: FOR %%A IN (chaîne) DO ( :: des commandes ) FOR /F [options] %%A IN (objets) DO ( :: des commandes ) FOR /L %%A IN (début,incrément,fin) DO ( :: des commandes )
hi: वस्तुओं (फ़ाइलों, पंक्तियां, कमांड आउटपुट) पर आदेश करें। प्रयोग: FOR %%A IN (string) DO ( :: कुछ आदेश ) FOR /F [options] %%A IN (object) DO ( :: कुछ आदेश ) FOR /L %%A IN (start,increment,end) DO ( :: कुछ आदेश )

source: Go to a label in a command script. Usage: GOTO [/Q] [/F[:]file] [:]label
ca: Vés a una etiqueta en un programa de comandaments. Ús: GOTO [/Q] [/F[:]fitxer] [:]etiqueta
fr: Saute vers une étiquette dans un script de commande. Usage: GOTO [/Q] [/F[:]file] étiquette
hi: कमांड स्क्रिप्ट में एक लेबल पर जाएं। उपयोग: GOTO [/Q] [/F[:] फ़ाइल] [:]लेबल

source: Perform commands on some conditions. Usage: IF [/i] [NOT] string1==string2 ( :: code to be ran ) IF [/i] string1 cmp string2 :: code to be ran ) IF [NOT] [DEFINED | EXIST | ERRORLEVEL] object ( :: code to be ran ) IF [ expression ] ( :: code to be ran )
ca: Realitza comandaments en algunes condicions. Ús: IF [/i] [NOT] cadena1==cadena2 ( :: codi per ser executat ) IF [/i] cadena1 cmp cadena2 :: codi per ser executat ) IF [NOT] [DEFINED | EXIST | ERRORLEVEL] objecte ( :: codi per ser executat ) IF [ expressió ] ( :: codi per ser executat )
fr: Effectue des opérations conditionnelles de commandes. Usage: IF [/i] [NOT] chaîne1==chaîne2 ( :: code à exécuter ) IF [/i] chaîne1 cmp chaîne2 :: code à exécuter ) IF [NOT] [DEFINED | EXIST | ERRORLEVEL] objet ( :: code à exécuter ) IF [ expression ] ( :: code à exécuter )
hi: कुछ स्थितियों पर आदेश करें। प्रयोग: IF [/i] [NOT] लाइन1==लाइन2 ( :: कोड चलाने के लिए ) IF [/i] लाइन1 cmp लाइन2 :: कोड चलाने के लिए ) IF [NOT] [DEFINED | EXIST | ERRORLEVEL] वस्तु ( :: कोड चलाने के लिए ) IF [ expression ] ( :: कोड चलाने के लिए )

source: Create the given directory. Usage: MD directory MKDIR directory
ca: Crea el directori especificat. Ús: MD directori MKDIR directori
fr: Crée un répertoire. Usage: MD répertoire MKDIR répertoire
hi: दी गई निर्देशिका/फ़ोल्डर बनाएं । उपयोग: MD निर्देशिका/फ़ोल्डर MKDIR निर्देशिका/फ़ोल्डर

source: Wait for a keystroke from the user. Usage: PAUSE
ca: Espera fins una pulsació de tecla de l'usuari. Ús: PAUSE
fr: Attend que l'utilisateur appuie sur une touche Usage: PAUSE
hi: उपयोगकर्ता से एक keystroke के लिए रुको । उपयोग: pause

source: Remove a directory. Usage: RMDIR [/S] [/Q] directory RD [/S] [/Q] directory
ca: Elimina un directori. Ús: RMDIR [/S] [/Q] directorI RD [/S] [/Q] directorI
fr: Supprime un répertoire Usage: RMDIR [/S] [/Q] répertoire RD [/S] [/Q] répertoire

source: Renames a file. Usage: REN file name.ext RENAME file name.ext
ca: Renombra un fitxer. Ús: REN fitxer nom.ext RENAME fitxer nom.ext
fr: Renomme un fichier. Usage: REN fichier nom.ext RENAME fichier nom.ext
hi: एक फ़ाइल का नाम बदलें। उपयोग: REN फ़ाइल नाम RENAME फ़ाइल नाम

source: Introduce a comment. Usage: REM comment
ca: Introdueix un comentari. Ús: REM comentari
fr: Introduit un commentaire. Usage: REM commentaire
hi: एक परिचय टिप्पणी। उपयोग: REM टिप्पणी
