Repository: GroophyLifefor/picobat
Catalog: po/*/pBat.po
Languages: ca, fr, hi

source: Set or list environment variables. Usage: SET variable=content SET /a[[:][i|f]] variable=expression SET /p variable=question SET var
ca: Estableix o llista variables d'entorn. Ús: SET variable=contingut SET /a[[:][i|f]] variable=expressió SET /a p variable=pregunta SET var
fr: Affecte une variable d'environement. Usage: SET variable=contenu SET /a[[:][i|f]] variable=expression SET /p variable=question SET var
hi: वातावरण चर सेट या सूचीबद्ध करें । उपयोग: Set चर=सामग्री set /a[[:][i|f] चर=अभिव्यक्ति set /p चर=प्रश्न set var

source: Reverts changes to environments and options made after a call to SETLOCAL. Usage: ENDLOCAL
ca: Reverteix els canvis a l'entorn i les opcions després de fer una crida a SETLOCAL. Ús: ENDLOCAL
fr: Anulle les changements de l'environnement et des options depuis le dernier SETLOCAL. Usage: ENDLOCAL
hi: SETLOCAL को कॉल करने के बाद किए गए परिवेशों और विकल्पों में परिवर्तन लौटाता है. उपयोग: ENDLOCAL

source: Set console title. Usage: TITLE title
ca: Estableix el títol de la consola. Ús: TITLE títol
fr: Modifie le titre de la console. Usage: TITLE titre
hi: कंसोल शीर्षक सेट करें। उपयोग: TITLE शीर्षक

source: Print a file. Usage: TYPE [file ...]
ca: Mostra el contingut d'un fitxer. Ús: TYPE [fitxer ...]
fr: Affiche le contenu d'un fichier. Usage: TYPE [fichier ...]
hi: एक फाइल प्रिंट करें। उपयोग: Type [फ़ाइल ...]

source: Exit from the command prompt. Usage: EXIT [/b] [code]
ca: Surt de l'intèrpret d'ordres. Ús: EXIT [/b] [codi]
fr: Quitte l'invité de commande. Usage: EXIT [/b] [code]
hi: कमांड प्रॉंप्ट से बाहर निकलें । उपयोग: Exit [/b] [कोड]

source: Change positions of command-line parameters. Usage: SHIFT [/start_number | /s[:]start_number] [/d[:]displacement]
ca: Canvia la posició dels paràmetres de la línia d'ordres. Ús: SHIFT [/número_inici | /s[:]número_inici] [/d[:]desplaçament]
fr: Change les positions des paramètres de ligne de commande. Usage: SHIFT [/nombre_début | /s[:]nombre_début] [/d[:]déplacement
hi: आदेश-पंक्ति पैरामीटर्स की स्थितियां परिवर्तित करें । उपयोग: SHIFT [/start_number | /s[:]start_number] [/d[:]विस्थापन]

source: Search occurrence of string in a set of files. Usage: FIND [/N] [/C] [/V] [/I] [/E] string [file ...]
ca: Troba una ocurrència d'una cadena en un conjunt de fitxers. Ús: FIND [/N] [/C] [/V] [/I] [/E] cadena [fitxer ...]
fr: Recherche les occurences d'une chaîne dans un groupe de fichiers. Usage: FIND [/N] [/C] [/V] [/I] [/E] chaîne [fichier ...]
hi: फ़ाइलों का एक सेट में स्ट्रिंग की खोज पुनरावृत्ति । उपयोग: ढूँढें [/N] [परि.] [/V] [/I] [/E] स्ट्रिंग [फ़ाइल...]

source: Display content of files. Usage: MORE [/E] [/P] [/S] [/C] [/T[:]n] [+n] [file ...]
ca: Mostra el contingut de fitxers. Ús: MORE [/E] [/P] [/S] [/C] [/T[:]n] [+n] [fitxer ...]
fr: Affiche le contenu d'un ou plusieur fichiers. Usage: MORE [/E] [/P] [/S] [/C] [/T[:]n] [+n] [fichier ...]
hi: फाइलों की सामग्री प्रदर्शित करें। उपयोग: MORE [/E] [/P] [/S] [/C] [/T[:]n] [+n] [फाइल ...]

source: [Obsolete] Sets or Clears Extended CTRL+C checking on DOS system. (Do nothing) Usage: BREAK [ON | OFF]
ca: [Obsolet] Estableix o neteja el CTRL+C estès en sistemes DOS. (No fa res) Ús: BREAK [ON | OFF]
fr: [Obsolète] Active ou désactive le contrôle de CTRL+C sur les systèmesDOS. (Ne fait rien) Usage: Break [ON | OFF]
hi: [अप्रचलित] डॉस सिस्टम पर विस्तारित CTRL + C जांच सेट या साफ़ करता है। (कुछ भी नहीं) उपयोग: BREAK [चालू | बंद]

source: Set Console codepage or encoding. Usage: CHCP [ codepage | encoding]
ca: Estableix la pàgina de codis o codificació. Ús: CHCP [pàgina de codis | codificació]
fr: Modifie l'encodage ou la page de code de la console de la console Usage: CHCP [ page_code | encodage]
hi: कंसोल कोडपेज या एंकोडिंग सेट करें । उपयोग: CHCP [कोडपेज | एंकोडिंग]

source: For each path, change current directory and pushd to stack the previous current directory. Usage: PUSHD [path1] [path2] [pathN] ...
ca: Per cada camí, canvia el directori actual i pushd per apilar el previ directori actual. Ús: PUSHD [camí1] [camí2] [camíN] ...
fr: Pour chaque chemin, change le répertoire courant et pousse sur la pile le répertoire courant précedent. Usage: PUSHD [chemin1] [chemin2] [cheminN] ...
hi: प्रत्येक पथ के लिए, वर्तमान निर्देशिका/फ़ोल्डर परिवर्तित करें और पिछले वर्तमान निर्देशिका स्टैक करने के लिए पुश । उपयोग: PUSHD [path1] [path2] [pathN]...

source: Pull a directory on the stack to change current directory. Usage: POPD
ca: Posa un directori a la pila per canviar el directori actual. Ús: POPD
fr: Tire un répertoire sur la pile pour changer le répertoire courant.Usage: POPD
hi: वर्तमान निर्देशिका बदलने के लिए स्टैक पर कोई निर्देशिका खींचें । उपयोग: POPD

source: Display counts of a file or of stdin. Usage: WC [/L] [/C] [/M] [/W] [files ...]
ca: Mostra els comptes d'un fitxer o de STDIN. Ús: WC [/L] [/C] [/M] [/W] [fitxers ...]
fr: Affiche les comptes d'un fichier ou de l'entrée standard. Usage: WC [/L] [/C] [/M] [/W] [fichiers ...]
hi: किसी फ़ाइल या stdin की संख्याएं प्रदर्शित करें । उपयोग: WC [/L] [/C] [/M] [/W] [फ़ाइलें...]

source: Run a command with arguments from standard input file. Usage: XARGS [command ...]
ca: Executa un comandament amb arguments des de l'entrada d'arxius estàndard. Ús: XARGS [comandament ...]
fr: Lance une commande en prenant les arguments sur l'entrée standard. Usage: XARGS [commande ...]
hi: मानक इनपुट फ़ाइल से तर्क के साथ कोई आदेश चलाएं । उपयोग: XARGS [आदेश...]

source: Print a message using prompt format. Usage: PECHO prompt-format PECHO.prompt-format
ca: Imprimeix un missatge usant el format del intèrpret. Ús: PECHO format-interpret PECHO.format-interpret
fr: Affiche un message formaté comme pour la commande PROMPT. Usage: PECHO format-prompt PECHO.format-prompt

source: Sleep for a delay in seconds. Usage: TIMEOUT [/T] [/NOBREAK] seconds[.milliseconds]
ca: Dorm durant un temps en segons. Ús: TIMEOUT [/T] [/NOBREAK] segons[.mil·lisegons]
fr: Attend un délai en secondes. Usage: TIMEOUT [/T] [/NOBREAK] secondes[.millisecondes]

source: Load or list modules. Usage: MOD [/L] [/Q] module
ca: Carrega o llista mòduls. Ús: MOD [/L] [/Q] mòdul
fr: Charge ou liste les modules chargés. Usage: MOD [/L] [/Q] module

source: Print the OS type and version Usage: VER
ca: Imprimeix el tipus de SO i la versió Ús: VER
fr: Affiche la type de système d'exploitation et sa version. Usage: VER

source: Start a program in another window Usage: START [/d dir] [/b] [/min] [/max] [/wait] ["title"] [command [parameter ...]]
fr: Lance un programme dans une nouvelle fenêtre Usage: START [/d dossier] [/b] [/min] [/max] [/wait] ["titre"] [commande [paramètres ...]]

source: Module loading not supported.
ca: Carregament de mòduls no suportat.
